# IsNameUnused Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPAnalyticalConnectionType..::..IsNameUnused Method
MEPAnalyticalConnectionType Class See Also
---
Checks if this is an unused name.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public static bool IsNameUnused(
	Document doc,
	string name
)
```

Visual Basic
---
```text
Public Shared Function IsNameUnused ( _
	doc As Document, _
	name As String _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsNameUnused(
	Document^ doc,
	String^ name
)
```

# ### Parameters
doc
    Type: Autodesk.Revit.DB..::..Document The document.
name
    Type: System..::..String The name to be verified.
# ### Return Value
True if not used by an existing analytical connection type in this document, false if used.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
MEPAnalyticalConnectionType Class
Autodesk.Revit.DB Namespace